Repository: Majeedoso/delivery_manager
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

source: Menu item deleted successfully
ar: تم حذف عنصر القائمة بنجاح
fr: Article du menu supprimé avec succès

source: Menu items updated successfully
ar: تم تحديث عناصر القائمة بنجاح
fr: Articles du menu mis à jour avec succès

source: Menu items deleted successfully
ar: تم حذف عناصر القائمة بنجاح
fr: Articles du menu supprimés avec succès

source: Categories reordered successfully
ar: تم إعادة ترتيب الفئات بنجاح
fr: Catégories réorganisées avec succès

source: Menu items reordered successfully
ar: تم إعادة ترتيب عناصر القائمة بنجاح
fr: Articles du menu réorganisés avec succès

source: Bank
ar: البنك
fr: Banque

source: Total Expected
ar: المبلغ المتوقع الإجمالي
fr: Total attendu

source: Driver Debts
ar: ديون السائقين
fr: Dettes des chauffeurs

source: Pending Payments
ar: المدفوعات المعلقة
fr: Paiements en attente

source: No pending transactions
ar: لا توجد معاملات معلقة
fr: Aucune transaction en attente

source: Error loading data
ar: خطأ في تحميل البيانات
fr: Erreur de chargement des données

source: No data available
ar: لا توجد بيانات متاحة
fr: Aucune donnée disponible

source: Restaurant System Manager Debt
ar: دين المطعم لمدير النظام
fr: Dette du restaurant au gestionnaire système

# restaurantSystemManagerDebtDescription
source: Amount restaurant owes to system manager (10% of order total)
ar: المبلغ الذي يدين به المطعم لمدير النظام (10% من إجمالي الطلب)
fr: Montant que le restaurant doit au gestionnaire système (10% du total de la commande)

# restaurantDebtToSystem
source: The restaurant's debt to the system
ar: دين المطعم للنظام
fr: La dette du restaurant envers le système

source: Amount
ar: المبلغ
fr: Montant

source: Driver
ar: سائق
fr: Chauffeur

source: Expected from Drivers
ar: المتوقع من السائقين
fr: Attendu des chauffeurs

source: Pay to System Administrator
ar: الدفع لمدير النظام
fr: Payer à l'administrateur système

source: Transactions
ar: المعاملات

source: Bank Archive
ar: أرشيف البنك
fr: Archives bancaires

source: Create Transaction
ar: إنشاء معاملة
fr: Créer une transaction

source: Pay System
ar: دفع للنظام
fr: Payer le système

source: Calculating amount...
ar: جاري حساب المبلغ...
fr: Calcul du montant...

source: Amount calculated
ar: تم حساب المبلغ
fr: Montant calculé

# noAmountForRange
source: No amount due for the selected date range
ar: لا يوجد مبلغ مستحق للفترة المحددة
fr: Aucun montant dû pour la période sélectionnée

# amountFieldReadOnly
source: Amount is automatically calculated based on selected date range
ar: يتم حساب المبلغ تلقائياً بناءً على الفترة المحددة
fr: Le montant est calculé automatiquement en fonction de la période sélectionnée

source: Pending Approvals
ar: الموافقات المعلقة
fr: Approbations en attente

source: My Pending Transactions
ar: معاملاتي المعلقة
fr: Mes transactions en attente

source: Transaction History
ar: سجل المعاملات
fr: Historique des transactions

source: Filter by Type
ar: تصفية حسب النوع
fr: Filtrer par type

source: Filter by Date
ar: تصفية حسب التاريخ
fr: Filtrer par date

source: Waiting for Approval
ar: في انتظار الموافقة
fr: En attente d'approbation

source: Approved by
ar: تمت الموافقة من قبل
fr: Approuvé par

source: Rejected by
ar: تم الرفض من قبل
fr: Rejeté par

source: Breakdown by Driver
ar: التفصيل حسب السائق
fr: Répartition par chauffeur

source: Breakdown
ar: التفاصيل
fr: Détails

# transactionType
source: Type
ar: النوع

# paymentToDriver
source: From Driver
ar: من السائق
fr: Du chauffeur

source: Payment to System
ar: دفع للنظام
fr: Paiement au système

source: Select Driver
ar: اختر السائق
fr: Sélectionner un chauffeur

source: Enter Amount
ar: أدخل المبلغ
fr: Entrer le montant

source: Submit
ar: إرسال
fr: Soumettre

source: Approve
ar: موافقة
fr: Approuver

source: Date
ar: التاريخ

source: Status
ar: الحالة
fr: Statut

source: Confirm Cancellation
ar: تأكيد الإلغاء
fr: Confirmer l'annulation

# cancelTransactionConfirmation
source: Are you sure you want to cancel this transaction? This action cannot be undone.
ar: هل أنت متأكد أنك تريد إلغاء هذه المعاملة؟ لا يمكن التراجع عن هذا الإجراء.
fr: Êtes-vous sûr de vouloir annuler cette transaction ? Cette action ne peut pas être annulée.

source: No
ar: لا
fr: Non

source: Yes, Cancel
ar: نعم، إلغاء
fr: Oui, annuler

# receivables
source: Credits
ar: المستحقات
fr: Créances

# payables
source: Debts
ar: المدفوعات
fr: Dettes

# receivablesAndPayables
source: Credits and Debts
ar: المستحقات والمدفوعات
fr: Créances et dettes

source: New Transaction
ar: معاملة جديدة
fr: Nouvelle transaction

source: Pending Transactions
ar: المعاملات المعلقة
fr: Transactions en Attente

# transactionsHistory
source: Transaction History
ar: سجل المعاملات
fr: Historique des transactions

source: Ratings
ar: التقييمات
fr: Évaluations

# ratingsTitle
source: Customer Ratings
ar: تقييمات العملاء
fr: Évaluations des clients

# ratingsDetailTitle
source: Rating Details
ar: تفاصيل التقييم
fr: Détails de l'évaluation

# ratingsBasedOn
source: Based on {count} ratings
ar: بناءً على {count} تقييم
fr: Basé sur {count} évaluations

# ratingsAnonymous
source: Anonymous Customer
ar: عميل مجهول
fr: Client anonyme

# ratingsResponded
source: Responded
ar: تم الرد
fr: Répondu

# ratingsReplyNow
source: Reply Now
ar: رد الآن
fr: Répondre maintenant

# ratingsResponseSuccess
source: Response submitted successfully
ar: تم إرسال الرد بنجاح
fr: Réponse envoyée avec succès

# ratingsOverallRating
source: Overall Rating
ar: التقييم العام
fr: Évaluation globale

# ratingsDate
source: Date
ar: التاريخ

# ratingsWouldReorder
source: Would Reorder
ar: سيطلب مجدداً
fr: Commanderait à nouveau

# ratingsWouldRecommend
source: Would Recommend
ar: سيوصي به
fr: Recommanderait

# ratingsDetailedRatings
source: Detailed Ratings
ar: التقييمات التفصيلية
fr: Évaluations détaillées

# ratingsFoodQuality
source: Food Quality
ar: جودة الطعام
fr: Qualité de la nourriture

# ratingsDeliverySpeed
source: Delivery Speed
ar: سرعة التوصيل
fr: Vitesse de livraison

# ratingsDriver
source: Driver
ar: السائق
fr: Chauffeur

# ratingsService
source: Service
ar: الخدمة

# ratingsComments
source: Comments
ar: التعليقات
fr: Commentaires

# ratingsGeneralComment
source: General Comment
ar: تعليق عام
fr: Commentaire général

# ratingsFoodComment
source: Food Comment
ar: تعليق على الطعام
fr: Commentaire sur la nourriture

# ratingsDeliveryComment
source: Delivery Comment
ar: تعليق على التوصيل
fr: Commentaire sur la livraison

# ratingsDriverComment
source: Driver Comment
ar: تعليق على السائق
fr: Commentaire sur le chauffeur

# ratingsRestaurantComment
source: Restaurant Comment
ar: تعليق على المطعم
fr: Commentaire sur le restaurant

# ratingsTags
source: Tags
ar: الوسوم

# ratingsYourResponse
source: Your Response
ar: ردك
fr: Votre réponse

# ratingsWriteResponse
source: Write a Response
ar: اكتب رداً
fr: Écrire une réponse

# ratingsResponseHint
source: Thank the customer or address their feedback...
ar: اشكر العميل أو عالج ملاحظاته...
fr: Remerciez le client ou répondez à ses commentaires...

# ratingsResponseRequired
source: Please enter a response
ar: الرجاء إدخال رد
fr: Veuillez entrer une réponse

# ratingsResponseMinLength
source: Response must be at least 10 characters
ar: يجب أن يكون الرد 10 أحرف على الأقل
fr: La réponse doit contenir au moins 10 caractères

# ratingsSubmitResponse
source: Submit Response
ar: إرسال الرد
fr: Envoyer la réponse

# ratingsEmptyTitle
source: No Ratings Yet
ar: لا توجد تقييمات بعد
fr: Pas encore d'évaluations

# ratingsEmptyMessage
source: Customer ratings will appear here once you receive them.
ar: ستظهر تقييمات العملاء هنا بمجرد استلامها.
fr: Les évaluations des clients apparaîtront ici une fois reçues.

# ratingsLoadMore
source: Load More
ar: تحميل المزيد
fr: Charger plus

# ratingsFilterAll
source: All
ar: الكل
fr: Tout

# ratingsFilterPositive
source: Positive
ar: إيجابية
fr: Positives

# ratingsFilterNegative
source: Negative
ar: سلبية
fr: Négatives

source: Order Counts
ar: عدد الطلبات
fr: Nombre de commandes

source: Performance
ar: الأداء

source: All Time
ar: كل الوقت
fr: Tout le temps

source: Today
ar: اليوم
fr: Aujourd'hui

source: This Week
ar: هذا الأسبوع
fr: Cette semaine

source: This Month
ar: هذا الشهر
fr: Ce mois

source: This Year
ar: هذه السنة
fr: Cette année

source: Custom
ar: مخصص
fr: Personnalisé

source: Response Speed
ar: سرعة الاستجابة
fr: Vitesse de réponse

# responseSpeedDescription
source: Time to accept or reject orders
ar: الوقت للقبول أو الرفض
fr: Temps pour accepter ou rejeter

source: Preparation Speed
ar: سرعة التحضير
fr: Vitesse de préparation

# preparationSpeedDescription
source: Time to prepare accepted orders
ar: الوقت لتحضير الطلبات المقبولة
fr: Temps pour préparer les commandes

source: Decision Quality
ar: جودة القرار
fr: Qualité des décisions

# decisionQualityDescription
source: Rate of completed vs accepted orders
ar: نسبة الطلبات المكتملة من المقبولة
fr: Taux de commandes terminées vs acceptées

source: Poor Decisions
ar: قرارات سيئة
fr: Mauvaises décisions

# poorDecisionsDescription
source: Rate of cancelled orders after acceptance
ar: نسبة الطلبات الملغاة بعد القبول
fr: Taux d'annulation après acceptation

# statisticsDataFrom
source: Data from
ar: بيانات من
fr: Données de

source: Delivered
ar: تم التوصيل
fr: Livré

source: Order Capacity
ar: سعة الطلبات
fr: Capacité de commandes

# canAcceptMoreOrders
source: You can accept {count} more order(s)
ar: يمكنك قبول {count} طلب(ات) أخرى
fr: Vous pouvez accepter {count} commande(s) supplémentaire(s)

# maxCapacityReached
source: Maximum capacity reached
ar: تم الوصول للحد الأقصى
fr: Capacité maximale atteinte

source: Preparing
ar: قيد التحضير
fr: En préparation

source: On Delivery
ar: قيد التوصيل
fr: En livraison

# noPreparingOrders
source: No orders being prepared
ar: لا توجد طلبات قيد التحضير
fr: Aucune commande en préparation

# noPreparingOrdersDescription
source: Orders waiting for food preparation will appear here
ar: ستظهر الطلبات التي تنتظر تحضير الطعام هنا
fr: Les commandes en attente de préparation apparaîtront ici

# noReadyOrders
source: No orders ready for pickup
ar: لا توجد طلبات جاهزة للاستلام
fr: Aucune commande prête

# noReadyOrdersDescription
source: Orders ready to be picked up will appear here
ar: ستظهر الطلبات الجاهزة للاستلام هنا
fr: Les commandes prêtes à être récupérées apparaîtront ici

# noDeliveringOrders
source: No orders on delivery
ar: لا توجد طلبات قيد التوصيل
fr: Aucune commande en livraison

# noDeliveringOrdersDescription
source: Orders you are delivering will appear here
ar: ستظهر الطلبات التي تقوم بتوصيلها هنا
fr: Les commandes que vous livrez apparaîtront ici

# markPickedUp
source: Mark as Picked Up
ar: تأكيد الاستلام
fr: Marquer comme récupéré

source: Navigate to Restaurant
ar: التوجه للمطعم
fr: Aller au restaurant

source: Navigate to Customer
ar: التوجه للعميل
fr: Aller chez le client

source: Reject Order
ar: رفض الطلب
fr: Rejeter la commande

# selectRejectionReason
source: Select a reason for rejection:
ar: اختر سبب الرفض:
fr: Sélectionnez une raison de rejet:

# rejectionReasonTooFar
source: Too far from my location
ar: بعيد جداً عن موقعي
fr: Trop loin de ma position

# rejectionReasonLowEarnings
source: Low earnings for this order
ar: أرباح منخفضة لهذا الطلب
fr: Gains trop faibles pour cette commande

# rejectionReasonBadArea
source: Delivery area is problematic
ar: منطقة التوصيل صعبة
fr: Zone de livraison problématique

# rejectionReasonBusy
source: Currently busy with other deliveries
ar: مشغول حالياً بتوصيلات أخرى
fr: Actuellement occupé avec d'autres livraisons

# rejectionReasonVehicleIssue
source: Vehicle/transportation issue
ar: مشكلة في المركبة/النقل
fr: Problème de véhicule/transport

# rejectionReasonPersonal
source: Personal reasons
ar: أسباب شخصية
fr: Raisons personnelles

# rejectionReasonOther
source: Other
ar: أخرى
fr: Autre

# additionalNotes
source: Additional Notes (optional)
ar: ملاحظات إضافية (اختياري)
fr: Notes supplémentaires (optionnel)

# additionalNotesHint
source: Add any additional details...
ar: أضف تفاصيل إضافية...
fr: Ajoutez des détails supplémentaires...

# confirmRejection
source: Reject
ar: رفض
fr: Rejeter

source: Order rejected
ar: تم رفض الطلب
fr: Commande rejetée

source: No rejected orders
ar: لا توجد طلبات مرفوضة
fr: Aucune commande rejetée

source: Rejected at
ar: تم الرفض في
fr: Rejeté le

# unassignOrder
source: Unassign from Order
ar: إلغاء التعيين من الطلب
fr: Se désassigner de la commande

# selectUnassignReason
source: Why can't you complete this order?
ar: لماذا لا يمكنك إكمال هذا الطلب؟
fr: Pourquoi ne pouvez-vous pas terminer cette commande ?

# unassignReasonVehicleBreakdown
source: Vehicle breakdown
ar: عطل في المركبة
fr: Panne de véhicule

# unassignReasonPersonalEmergency
source: Personal emergency
ar: طارئ شخصي
fr: Urgence personnelle

# unassignReasonSafetyConcern
source: Safety concern at location
ar: مخاوف أمنية في الموقع
fr: Problème de sécurité sur place

# unassignReasonCannotReach
source: Cannot reach pickup/delivery location
ar: لا يمكن الوصول إلى موقع الاستلام/التسليم
fr: Impossible d'atteindre le lieu de prise en charge/livraison

# unassignReasonLongWait
source: Restaurant wait time too long
ar: وقت انتظار طويل في المطعم
fr: Temps d'attente au restaurant trop long

# unassignReasonOrderIssue
source: Issue with order (missing items, wrong order)
ar: مشكلة في الطلب (عناصر مفقودة، طلب خاطئ)
fr: Problème avec la commande (articles manquants, mauvaise commande)

# unassignReasonOther
source: Other reason
ar: سبب آخر
fr: Autre raison

# confirmUnassign
source: Unassign
ar: إلغاء التعيين
fr: Se désassigner

# orderUnassigned
source: Unassigned from order
ar: تم إلغاء التعيين من الطلب
fr: Désassigné de la commande

# unassignOnDeliveryWarning
source: Emergency only! Unassigning during delivery is serious and will be reviewed. Only use for genuine emergencies.
ar: حالة طارئة فقط! إلغاء التعيين أثناء التوصيل أمر خطير وسيتم مراجعته. استخدم فقط في حالات الطوارئ الحقيقية.
fr: Urgence uniquement ! Se désassigner pendant la livraison est grave et sera examiné. N'utilisez que pour de véritables urgences.

# unassignReadyWarning
source: The food is ready and waiting. Unassigning now may affect food quality for the customer.
ar: الطعام جاهز وفي انتظار. إلغاء التعيين الآن قد يؤثر على جودة الطعام للعميل.
fr: La nourriture est prête et attend. Se désassigner maintenant peut affecter la qualité de la nourriture pour le client.

# unassignEmergencyNotesHint
source: Please describe the emergency situation...
ar: يرجى وصف حالة الطوارئ...
fr: Veuillez décrire la situation d'urgence...

# unassignConsequenceNotice
source: Frequent unassignments may affect your driver metrics. The order will be returned to the available pool.
ar: إلغاء التعيين المتكرر قد يؤثر على مقاييس السائق الخاصة بك. سيعود الطلب إلى مجموعة الطلبات المتاحة.
fr: Les désassignements fréquents peuvent affecter vos métriques de conducteur. La commande retournera dans le pool disponible.

# cantCompleteOrder
source: Can't Complete
ar: لا يمكن الإكمال
fr: Impossible de terminer

source: Total Debt
ar: إجمالي الدين
fr: Dette totale

# systemDebt
source: System
ar: دين النظام
fr: Dette système

# systemDebtDescription
source: Amount owed to system manager for delivery fees
ar: المبلغ المستحق لمدير النظام لرسوم التوصيل
fr: Montant dû au gestionnaire du système pour les frais de livraison

# restaurantDebts
source: Restaurants
ar: ديون المطاعم
fr: Dettes restaurant

# restaurantCredits
source: Restaurants
ar: المطاعم

source: Record Payment
ar: تسجيل الدفع
fr: Enregistrer le paiement

source: Record System Payment
ar: تسجيل دفع النظام
fr: Enregistrer le paiement système

source: Pay System Debt
ar: دفع دين النظام
fr: Payer la dette système

source: Payment to Restaurant
ar: دفع للمطعم
fr: Paiement au restaurant

# noDebts
source: No Outstanding Debts
ar: لا توجد ديون مستحقة
fr: Aucune dette en cours

source: Confirmed At
ar: تم التأكيد في
fr: Confirmé le

source: Invalid amount
ar: مبلغ غير صالح
fr: Montant invalide

source: Record
ar: تسجيل
fr: Enregistrer

source: No Transactions Found
ar: لا توجد معاملات
fr: Aucune transaction trouvée

source: Payment Type
ar: نوع الدفع
fr: Type de paiement

source: Select Restaurant
ar: اختر مطعم
fr: Sélectionner un restaurant

source: Payment Date
ar: تاريخ الدفع
fr: Date de paiement

source: Pickup Speed
ar: سرعة الاستلام
fr: Vitesse de récupération

# pickupSpeedDescription
source: Time from food ready to pickup
ar: الوقت من جاهزية الطعام إلى الاستلام
fr: Temps entre la préparation et la récupération

# pickupSpeedGood
source: Faster pickup (under 10 minutes) ensures fresh food and happy customers.
ar: الاستلام السريع (أقل من 10 دقائق) يضمن طعامًا طازجًا وعملاء سعداء.
fr: Une récupération rapide (moins de 10 minutes) garantit une nourriture fraîche et des clients satisfaits.

# pickupSpeedBad
source: Slow pickup (over 20 minutes) may result in cold food and unhappy customers.
ar: الاستلام البطيء (أكثر من 20 دقيقة) قد يؤدي إلى طعام بارد وعملاء غير راضين.
fr: Une récupération lente (plus de 20 minutes) peut entraîner une nourriture froide et des clients mécontents.

source: Delivery Speed
ar: سرعة التوصيل
fr: Vitesse de livraison

# deliverySpeedDescription
source: Time from pickup to delivery
ar: الوقت من الاستلام إلى التوصيل
fr: Temps entre la récupération et la livraison

# deliverySpeedGood
source: Fast delivery (under 20 minutes) leads to satisfied customers and better ratings.
ar: التوصيل السريع (أقل من 20 دقيقة) يؤدي إلى عملاء راضين وتقييمات أفضل.
fr: Une livraison rapide (moins de 20 minutes) mène à des clients satisfaits et de meilleures notes.

# deliverySpeedBad
source: Slow delivery (over 40 minutes) can result in complaints and lower ratings.
ar: التوصيل البطيء (أكثر من 40 دقيقة) قد يؤدي إلى شكاوى وتقييمات أقل.
fr: Une livraison lente (plus de 40 minutes) peut entraîner des plaintes et des notes plus basses.

source: Completion Rate
ar: معدل الإكمال
fr: Taux de réalisation

# completionRateDescription
source: Percentage of accepted orders that were delivered
ar: نسبة الطلبات المقبولة التي تم توصيلها
fr: Pourcentage de commandes acceptées qui ont été livrées

# completionRateGood
source: High rate (95%+) shows reliability and professionalism.
ar: معدل عالٍ (95%+) يظهر الموثوقية والاحترافية.
fr: Un taux élevé (95%+) montre fiabilité et professionnalisme.

# completionRateBad
source: Low rate (below 85%) indicates issues with order handling.
ar: معدل منخفض (أقل من 85%) يشير إلى مشاكل في معالجة الطلبات.
fr: Un taux bas (moins de 85%) indique des problèmes dans la gestion des commandes.

source: Cancellation Rate
ar: معدل الإلغاء
fr: Taux d'annulation

# cancellationRateDescription
source: Percentage of accepted orders that were cancelled
ar: نسبة الطلبات المقبولة التي تم إلغاؤها
fr: Pourcentage de commandes acceptées qui ont été annulées

# cancellationRateGood
source: Low rate (under 5%) is excellent and shows consistent service.
ar: معدل منخفض (أقل من 5%) ممتاز ويظهر خدمة متسقة.
fr: Un taux bas (moins de 5%) est excellent et montre un service constant.

# cancellationRateBad
source: High rate (over 15%) raises concerns about reliability.
ar: معدل عالٍ (أكثر من 15%) يثير مخاوف حول الموثوقية.
fr: Un taux élevé (plus de 15%) soulève des inquiétudes sur la fiabilité.

# iHaveArrived
source: I've Arrived
ar: لقد وصلت
fr: Je suis arrivé

source: Arrived
ar: وصل
fr: Arrivé

source: Driver Arrived
ar: وصل السائق
fr: Chauffeur arrivé

source: OK
ar: حسناً

source: Understood
ar: فهمت
fr: Compris

source: Try Again
ar: حاول مجدداً
fr: Réessayer

source: Wrong App
ar: تطبيق خاطئ
fr: Mauvaise application

source: Account Not Found
ar: الحساب غير موجود
fr: Compte non trouvé

# accountNotFoundMessage
source: No account found with this email. Please sign up first.
ar: لم يتم العثور على حساب بهذا البريد الإلكتروني. يرجى التسجيل أولاً.
fr: Aucun compte trouvé avec cet e-mail. Veuillez d'abord vous inscrire.

source: Login Failed
ar: فشل تسجيل الدخول
fr: Échec de la connexion

# invalidCredentialsMessage
source: The email or password you entered is incorrect. Please check your credentials and try again.
ar: البريد الإلكتروني أو كلمة المرور التي أدخلتها غير صحيحة. يرجى التحقق من بيانات الاعتماد والمحاولة مرة أخرى.
fr: L'e-mail ou le mot de passe que vous avez entré est incorrect. Veuillez vérifier vos identifiants et réessayer.

source: Overpay
ar: دفع زائد
fr: Paiement excédentaire

source: Credit
ar: رصيد
fr: Crédit

source: User Management
ar: إدارة المستخدمين

source: Error Loading Users
ar: خطأ في تحميل المستخدمين

source: No Users Found
ar: لم يتم العثور على مستخدمين

# noUsersMatchFilters
source: No users match your filters
ar: لا يوجد مستخدمون يطابقون المرشحات

# noUsersInSystem
source: No users in the system
ar: لا يوجد مستخدمون في النظام

source: User approved successfully
ar: تمت الموافقة على المستخدم بنجاح

source: User rejected successfully
ar: تم رفض المستخدم بنجاح

source: User suspended successfully
ar: تم تعليق المستخدم بنجاح

source: User activated successfully
ar: تم تنشيط المستخدم بنجاح

source: Change Status
ar: تغيير الحالة

source: Pending Approval
ar: في انتظار الموافقة

source: Suspended
ar: معلق

# rejectedStatus
source: Rejected
ar: مرفوض

source: Operator
ar: مشغل

source: Manager
ar: مدير

source: Filters
ar: المرشحات

source: Clear
ar: مسح

source: All Roles
ar: جميع الأدوار

source: All Statuses
ar: جميع الحالات

source: Reject User
ar: رفض المستخدم

# rejectingUser
source: Rejecting: {userName}
ar: جاري رفض: {userName}

# rejectionReasonLabel
source: Rejection Reason *
ar: سبب الرفض *

# enterRejectionReason
source: Enter reason for rejection...
ar: أدخل سبب الرفض...

# minimumCharacters
source: Minimum 10 characters
ar: 10 أحرف كحد أدنى

# rejectionReasonRequired
source: Rejection reason is required
ar: سبب الرفض مطلوب

# reasonMinimum10Characters
source: Reason must be at least 10 characters
ar: يجب أن يكون السبب 10 أحرف على الأقل

source: Suspend User
ar: تعليق المستخدم

# suspendingUser
source: Suspending: {userName}
ar: جاري تعليق: {userName}

# suspensionReasonLabel
source: Suspension Reason *
ar: سبب التعليق *

# enterSuspensionReason
source: Enter reason for suspension...
ar: أدخل سبب التعليق...

# suspensionReasonRequired
source: Suspension reason is required
ar: سبب التعليق مطلوب

# searchUsers
source: Search by name, email or phone
ar: البحث بالاسم أو البريد الإلكتروني أو الهاتف

source: Coupons
ar: قسائم الخصم

source: Restaurant Coupons
ar: قسائم المطاعم

source: Delivery Coupons
ar: قسائم التوصيل

source: Draft
ar: مسودة

source: Disabled
ar: معطل

source: New Delivery Coupon
ar: قسيمة توصيل جديدة

source: New Coupon
ar: قسيمة جديدة

source: No delivery coupons yet
ar: لا توجد قسائم توصيل بعد

source: No coupons yet
ar: لا توجد قسائم بعد

# createFirstDeliveryCoupon
source: Create your first delivery coupon!
ar: أنشئ قسيمة التوصيل الأولى!

# createFirstCoupon
source: Create your first coupon to attract more customers!
ar: أنشئ قسيمتك الأولى لجذب المزيد من العملاء!

source: OFF
ar: خصم

source: Discount
ar: خصم

source: Valid
ar: صالح

source: Uses
ar: الاستخدامات

source: Min Order
ar: الحد الأدنى للطلب

source: DZD
ar: دج

source: Expired
ar: منتهية الصلاحية

source: Global (all restaurants)
ar: عام (جميع المطاعم)

source: Issuer:
ar: المُصدر:

source: Discard Changes?
ar: تجاهل التغييرات؟

source: Edit Coupon
ar: تعديل القسيمة

source: Update
ar: تحديث

source: Create
ar: إنشاء

source: Coupon Code
ar: كود القسيمة

# couponCodeHint
source: e.g. SUMMER20
ar: مثال: SUMMER20

# pleaseEnterCouponCode
source: Please enter a coupon code
ar: الرجاء إدخال كود القسيمة

# codeMinLength
source: Code must be at least 3 characters
ar: يجب أن يكون الكود 3 أحرف على الأقل

source: Type
ar: النوع

source: Percentage
ar: نسبة مئوية

source: Fixed Amount
ar: مبلغ ثابت

source: Value
ar: القيمة

source: Required
ar: مطلوب

source: Min 1
ar: الحد الأدنى 1

# max100Percent
source: Max 100%
ar: الحد الأقصى 100%
