Repository: Majeedoso/delivery_manager
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

# errorServerUnavailable
source: Service temporarily unavailable. Please try again later.
ar: الخدمة غير متاحة مؤقتاً. يرجى المحاولة مرة أخرى لاحقاً.
fr: Service temporairement indisponible. Veuillez réessayer plus tard.

# errorServerGeneric
source: Server error occurred. Please try again later.
ar: حدث خطأ في الخادم. يرجى المحاولة مرة أخرى لاحقاً.
fr: Une erreur serveur s'est produite. Veuillez réessayer plus tard.

# errorDatabaseLocal
source: Unable to save data locally. Please try again.
ar: تعذر حفظ البيانات محلياً. يرجى المحاولة مرة أخرى.
fr: Impossible d'enregistrer les données localement. Veuillez réessayer.

# errorCacheLoad
source: Unable to load cached data. Please refresh.
ar: تعذر تحميل البيانات المخزنة مؤقتاً. يرجى التحديث.
fr: Impossible de charger les données en cache. Veuillez actualiser.

# errorAuthFailed
source: Authentication failed. Please check your credentials and try again.
ar: فشل المصادقة. يرجى التحقق من بيانات الاعتماد والمحاولة مرة أخرى.
fr: L'authentification a échoué. Veuillez vérifier vos identifiants et réessayer.

# errorInvalidCredentials
source: Invalid email or password. Please check your credentials and try again.
ar: بريد إلكتروني أو كلمة مرور غير صحيحة. يرجى التحقق من بيانات الاعتماد والمحاولة مرة أخرى.
fr: E-mail ou mot de passe invalide. Veuillez vérifier vos identifiants et réessayer.

# errorAuthRequired
source: Authentication required. Please login again.
ar: المصادقة مطلوبة. يرجى تسجيل الدخول مرة أخرى.
fr: Authentification requise. Veuillez vous reconnecter.

# errorSignInCancelled
source: Sign-in was cancelled.
ar: تم إلغاء تسجيل الدخول.
fr: La connexion a été annulée.

# errorServerMaintenance
source: Service is temporarily unavailable for maintenance. Please try again later.
ar: الخدمة غير متاحة مؤقتاً للصيانة. يرجى المحاولة مرة أخرى لاحقاً.
fr: Service temporairement indisponible pour maintenance. Veuillez réessayer plus tard.

# errorDatabaseServer
source: Database error occurred. Please try again later.
ar: حدث خطأ في قاعدة البيانات. يرجى المحاولة مرة أخرى لاحقاً.
fr: Une erreur de base de données s'est produite. Veuillez réessayer plus tard.

source: Error loading orders
ar: خطأ في تحميل الطلبات
fr: Erreur lors du chargement des commandes

source: Order
ar: طلب
fr: Commande

source: Customer
ar: عميل
fr: Client

source: Restaurant
ar: مطعم

source: Description
ar: الوصف

source: Address
ar: العنوان
fr: Adresse

source: Is Open
ar: مفتوح
fr: Est ouvert

# restaurantAndNotes
source: Restaurant & Notes
ar: المطعم والملاحظات
fr: Restaurant et Notes

source: Notes
ar: ملاحظات

# rejectionReason
source: Reason
ar: السبب
fr: Raison

source: Delivery Instructions
ar: تعليمات التسليم
fr: Instructions de livraison

source: Confirm
ar: تأكيد
fr: Confirmer

source: Reject
ar: رفض
fr: Rejeter

source: Start Preparing
ar: بدء التحضير
fr: Commencer la préparation

source: Mark Ready
ar: تمييز جاهز
fr: Marquer comme prêt

source: Picked Up
ar: تم الاستلام
fr: Récupéré

source: Mark Delivered
ar: تمييز تم التسليم
fr: Marquer comme livré

source: Load More
ar: تحميل المزيد
fr: Charger plus

source: No Pending Orders
ar: لا توجد طلبات معلقة
fr: Aucune commande en attente

# noPendingOrdersDescription
source: There are no pending orders in this date range.
ar: لا توجد طلبات معلقة في هذا النطاق الزمني.
fr: Il n'y a aucune commande en attente dans cette plage de dates.

source: No Ongoing Orders
ar: لا توجد طلبات قيد التنفيذ
fr: Aucune commande en cours

# noOngoingOrdersDescription
source: There are no ongoing orders in this date range.
ar: لا توجد طلبات قيد التنفيذ في هذا النطاق الزمني.
fr: Il n'y a aucune commande en cours dans cette plage de dates.

source: Select Delivery Method
ar: اختر طريقة التوصيل
fr: Sélectionner la méthode de livraison

source: Self Delivery
ar: توصيل ذاتي
fr: Livraison propre

source: External Delivery
ar: توصيل خارجي
fr: Livraison externe

# selfDeliveryDescription
source: The restaurant will deliver the order with its own driver
ar: سيقوم المطعم بتوصيل الطلب باستخدام سائقه الخاص
fr: Le restaurant livrera la commande avec son propre chauffeur

# externalDeliveryDescription
source: The order will be picked up by third-party drivers
ar: سيتم استلام الطلب من قبل سائقي التوصيل الخارجيين
fr: La commande sera récupérée par des chauffeurs tiers

# pleaseSelectDeliveryMethod
source: Please select a delivery method before marking the order as ready
ar: يرجى اختيار طريقة التوصيل قبل تحديد الطلب كجاهز
fr: Veuillez sélectionner une méthode de livraison avant de marquer la commande comme prête

source: Drivers
ar: السائقون
fr: Chauffeurs

source: Add Driver
ar: إضافة سائق
fr: Ajouter un chauffeur

source: Edit Driver
ar: تعديل سائق
fr: Modifier le chauffeur

source: Delete Driver
ar: حذف سائق
fr: Supprimer le chauffeur

source: Driver Code
ar: رمز السائق
fr: Code du chauffeur

# driverCodeRequired
source: Driver code is required
ar: رمز السائق مطلوب
fr: Le code du chauffeur est requis

# noDriversAdded
source: No drivers added yet
ar: لم يتم إضافة سائقين بعد
fr: Aucun chauffeur ajouté pour le moment

# pleaseAddDriverBeforeSelfDelivery
source: Please add a driver in your profile before choosing Self Delivery.
ar: يرجى إضافة سائق في ملفك الشخصي قبل اختيار التوصيل الذاتي.
fr: Veuillez ajouter un chauffeur dans votre profil avant de choisir la livraison propre.

source: Select Drivers for Delivery
ar: اختر السائقين للتوصيل
fr: Sélectionner les chauffeurs pour la livraison

source: Select All Drivers
ar: اختر جميع السائقين
fr: Sélectionner tous les chauffeurs

source: Select Specific Drivers
ar: اختر سائقين محددين
fr: Sélectionner des chauffeurs spécifiques

# driverSelected
source: {count} driver(s) selected
ar: {count} سائق محدد
fr: {count} chauffeur(s) sélectionné(s)

# driverCodeNotFound
source: Driver code not found. Please enter a valid driver code.
ar: لم يتم العثور على رمز السائق. يرجى إدخال رمز سائق صالح.
fr: Code chauffeur introuvable. Veuillez entrer un code chauffeur valide.

# driverAlreadyLinked
source: This driver is already linked to your restaurant.
ar: هذا السائق مرتبط بالفعل بمطعمك.
fr: Ce chauffeur est déjà lié à votre restaurant.

source: Driver linked successfully!
ar: تم ربط السائق بنجاح!
fr: Chauffeur lié avec succès!

source: Request Timeout
ar: انتهت مهلة الطلب
fr: Délai d'attente de la requête

# requestTimeoutDescription
source: The request took too long to complete. Please check your internet connection and try again.
ar: استغرق الطلب وقتاً طويلاً للإكمال. يرجى التحقق من اتصالك بالإنترنت والمحاولة مرة أخرى.
fr: La requête a pris trop de temps à se terminer. Veuillez vérifier votre connexion Internet et réessayer.

source: Call
ar: اتصال
fr: Appeler

source: Failed to open phone app
ar: فشل فتح تطبيق الهاتف
fr: Échec de l'ouverture de l'application téléphone

source: Error making phone call
ar: خطأ في إجراء المكالمة
fr: Erreur lors de l'appel téléphonique

source: Orders loaded successfully
ar: تم تحميل الطلبات بنجاح
fr: Commandes chargées avec succès

source: Order confirmed successfully
ar: تم تأكيد الطلب بنجاح
fr: Commande confirmée avec succès

source: Order rejected successfully
ar: تم رفض الطلب بنجاح
fr: Commande rejetée avec succès

# confirmOrder
source: Confirm
ar: تأكيد
fr: Confirmer

# areYouSureConfirmOrder
source: Are you sure you want to confirm this order?
ar: هل أنت متأكد أنك تريد تأكيد هذا الطلب؟
fr: Êtes-vous sûr de vouloir confirmer cette commande ?

# confirmOrderDescription
source: This will approve the order and make it visible to the restaurant.
ar: سيؤدي هذا إلى الموافقة على الطلب وجعله مرئياً للمطعم.
fr: Cela approuvera la commande et la rendra visible au restaurant.

# pleaseSelectRejectReason
source: Please select a reason for rejecting this order:
ar: يرجى اختيار سبب لرفض هذا الطلب:
fr: Veuillez sélectionner une raison pour rejeter cette commande :

source: Enter your reason...
ar: أدخل سببك...
fr: Entrez votre raison...

# rejectReasonDidntPickUp
source: Didn't pick up the phone
ar: لم يرد على الهاتف
fr: N'a pas répondu au téléphone

# rejectReasonSuspiciousBehavior
source: Suspicious customer behavior
ar: سلوك العميل مشبوه
fr: Comportement suspect du client

# rejectReasonInvalidAddress
source: Invalid delivery address
ar: عنوان التسليم غير صحيح
fr: Adresse de livraison invalide

# rejectReasonUnrealisticAmount
source: Order amount seems unrealistic
ar: مبلغ الطلب يبدو غير واقعي
fr: Le montant de la commande semble irréaliste

# rejectReasonInvalidContact
source: Customer contact information invalid
ar: معلومات الاتصال بالعميل غير صحيحة
fr: Informations de contact du client invalides

# rejectReasonRestaurantUnavailable
source: Restaurant not available
ar: المطعم غير متاح
fr: Restaurant non disponible

source: Other
ar: أخرى
fr: Autre

# currentPasswordRequired
source: Current password is required
ar: كلمة المرور الحالية مطلوبة
fr: Le mot de passe actuel est requis

# newPasswordRequired
source: New password is required
ar: كلمة المرور الجديدة مطلوبة
fr: Le nouveau mot de passe est requis

# passwordMinLength8
source: Password must be at least 8 characters
ar: يجب أن تكون كلمة المرور 8 أحرف على الأقل
fr: Le mot de passe doit contenir au moins 8 caractères

# passwordComplexity
source: Password must contain uppercase, lowercase, number, and symbol
ar: يجب أن تحتوي كلمة المرور على حرف كبير وصغير ورقم ورمز
fr: Le mot de passe doit contenir une majuscule, une minuscule, un chiffre et un symbole

# pleaseConfirmNewPassword
source: Please confirm your new password
ar: يرجى تأكيد كلمة المرور الجديدة
fr: Veuillez confirmer votre nouveau mot de passe

source: Passwords do not match
ar: كلمات المرور غير متطابقة
fr: Les mots de passe ne correspondent pas

source: Delete Account
ar: حذف الحساب
fr: Supprimer le compte

# deleteAccountConfirmation
source: Are you sure you want to delete your account? This action cannot be undone and all your data will be permanently deleted. You will need to verify your identity with an OTP code sent to your email.
ar: هل أنت متأكد من أنك تريد حذف حسابك؟ لا يمكن التراجع عن هذا الإجراء وستتم إزالة جميع بياناتك بشكل دائم. ستحتاج إلى التحقق من هويتك برمز OTP سيتم إرساله إلى بريدك الإلكتروني.
fr: Êtes-vous sûr de vouloir supprimer votre compte ? Cette action est irréversible et toutes vos données seront définitivement supprimées. Vous devrez vérifier votre identité avec un code OTP envoyé à votre adresse e-mail.

# continueButton
source: Continue
ar: متابعة
fr: Continuer

# errorOpeningUrl
source: Error opening URL: {error}
ar: خطأ في فتح الرابط: {error}
fr: Erreur lors de l'ouverture de l'URL : {error}

# appStoreUrlNotConfigured
source: App Store URL is not configured. Please update the app manually from the App Store.
ar: رابط متجر التطبيقات غير مُكوّن. يرجى تحديث التطبيق يدوياً من متجر التطبيقات.
fr: L'URL de l'App Store n'est pas configurée. Veuillez mettre à jour l'application manuellement depuis l'App Store.

# unableToDetermineAppPackage
source: Unable to determine app package. Please update the app manually from {store}.
ar: تعذر تحديد حزمة التطبيق. يرجى تحديث التطبيق يدوياً من {store}.
fr: Impossible de déterminer le package de l'application. Veuillez mettre à jour l'application manuellement depuis {store}.

# unableToOpenStore
source: Unable to open {store}. Please update the app manually.
ar: تعذر فتح {store}. يرجى تحديث التطبيق يدوياً.
fr: Impossible d'ouvrir {store}. Veuillez mettre à jour l'application manuellement.

# errorOpeningAppStore
source: Error opening app store: {error}. Please update the app manually.
ar: خطأ في فتح متجر التطبيقات: {error}. يرجى تحديث التطبيق يدوياً.
fr: Erreur lors de l'ouverture du magasin d'applications : {error}. Veuillez mettre à jour l'application manuellement.

source: Email verified successfully
ar: تم التحقق من البريد الإلكتروني بنجاح
fr: E-mail vérifié avec succès

source: Failed to verify email OTP
ar: فشل التحقق من رمز OTP للبريد الإلكتروني
fr: Échec de la vérification de l'OTP de l'e-mail

# requestTimeoutCheckConnection
source: Request timeout. Please check your internet connection and try again.
ar: انتهت مهلة الطلب. يرجى التحقق من اتصالك بالإنترنت والمحاولة مرة أخرى.
fr: Délai d'attente de la requête dépassé. Veuillez vérifier votre connexion Internet et réessayer.

# cannotConnectToServer
source: Cannot connect to server. Please check your internet connection.
ar: تعذر الاتصال بالخادم. يرجى التحقق من اتصالك بالإنترنت.
fr: Impossible de se connecter au serveur. Veuillez vérifier votre connexion Internet.

# verificationOtpSentSuccessfully
source: Verification OTP sent successfully. Please check your email.
ar: تم إرسال رمز التحقق OTP بنجاح. يرجى التحقق من بريدك الإلكتروني.
fr: OTP de vérification envoyé avec succès. Veuillez vérifier votre e-mail.

source: Failed to resend verification OTP
ar: فشل إعادة إرسال رمز التحقق OTP
fr: Échec de la réenvoi de l'OTP de vérification

# emailChangeOtpSentSuccessfully
source: Email change OTP sent successfully. Please check your new email.
ar: تم إرسال رمز OTP لتغيير البريد الإلكتروني بنجاح. يرجى التحقق من بريدك الإلكتروني الجديد.
fr: OTP de changement d'e-mail envoyé avec succès. Veuillez vérifier votre nouvel e-mail.

# pleaseEnterValid6DigitOtp
source: Please enter a valid 6-digit OTP
ar: يرجى إدخال رمز OTP صحيح مكون من 6 أرقام
fr: Veuillez entrer un OTP valide à 6 chiffres

source: Failed to get legal URLs
ar: فشل الحصول على روابط المستندات القانونية
fr: Échec de la récupération des URL légales

# networkErrorCheckConnection
source: Network error. Please check your internet connection.
ar: خطأ في الشبكة. يرجى التحقق من اتصالك بالإنترنت.
fr: Erreur réseau. Veuillez vérifier votre connexion Internet.

source: Server error occurred
ar: حدث خطأ في الخادم
fr: Une erreur serveur s'est produite

source: Failed to get contact information
ar: فشل الحصول على معلومات الاتصال
fr: Échec de la récupération des informations de contact

# unexpectedErrorOccurred
source: An unexpected error occurred: {error}
ar: حدث خطأ غير متوقع: {error}
fr: Une erreur inattendue s'est produite : {error}

source: App Store
ar: متجر التطبيقات

source: Play Store
ar: متجر Google Play

# urlNotAvailable
source: URL not available. Please try again later.
ar: الرابط غير متاح. يرجى المحاولة مرة أخرى لاحقاً.
fr: URL non disponible. Veuillez réessayer plus tard.

# unableToOpenUrlTryAgain
source: Unable to open URL. Please try again.
ar: تعذر فتح الرابط. يرجى المحاولة مرة أخرى.
fr: Impossible d'ouvrir l'URL. Veuillez réessayer.

# unableToOpenUrlCheckConnection
source: Unable to open URL. Please check your internet connection.
ar: تعذر فتح الرابط. يرجى التحقق من اتصالك بالإنترنت.
fr: Impossible d'ouvrir l'URL. Veuillez vérifier votre connexion Internet.

source: An error occurred
ar: حدث خطأ
fr: Une erreur s'est produite

source: Opening Hours
ar: ساعات العمل
fr: Heures d'ouverture

source: Closed
ar: مغلق
fr: Fermé

source: Monday
ar: الاثنين
fr: Lundi

source: Tuesday
ar: الثلاثاء
fr: Mardi

source: Wednesday
ar: الأربعاء
fr: Mercredi

source: Thursday
ar: الخميس
fr: Jeudi

source: Friday
ar: الجمعة
fr: Vendredi

source: Saturday
ar: السبت
fr: Samedi

source: Sunday
ar: الأحد
fr: Dimanche

source: Open
ar: فتح
fr: Ouverture

source: Schedule
ar: الجدول الزمني
fr: Horaire

# restaurantIsOpen
source: Restaurant is currently open
ar: المطعم مفتوح حالياً
fr: Le restaurant est actuellement ouvert

# restaurantIsClosed
source: Restaurant is currently closed
ar: المطعم مغلق حالياً
fr: Le restaurant est actuellement fermé

source: Update Schedule
ar: تحديث الجدول الزمني
fr: Mettre à jour l'horaire

# driverAvailability
source: Availability
ar: التوفر
fr: Disponibilité

# driverIsAvailable
source: You are currently available for deliveries
ar: أنت متاح حاليًا للتوصيل
fr: Vous êtes actuellement disponible pour les livraisons

# driverIsUnavailable
source: You are currently unavailable for deliveries
ar: أنت غير متاح حاليًا للتوصيل
fr: Vous n'êtes actuellement pas disponible pour les livraisons

source: Unsaved Changes
ar: تغييرات غير محفوظة
fr: Modifications non enregistrées

# unsavedChangesMessage
source: You have unsaved changes. Do you want to save them or discard them?
ar: لديك تغييرات غير محفوظة. هل تريد حفظها أم تجاهلها؟
fr: Vous avez des modifications non enregistrées. Voulez-vous les enregistrer ou les annuler?

source: Save
ar: حفظ
fr: Enregistrer

source: Discard
ar: تجاهل
fr: Annuler

source: Select Location Method
ar: اختر طريقة تحديد الموقع
fr: Sélectionner la méthode de localisation

source: Manual Entry
ar: تعديل يدوي
fr: Saisie manuelle

source: From Map
ar: من الخارطة
fr: Depuis la carte

source: Select Location on Map
ar: اختر الموقع على الخريطة
fr: Sélectionner l'emplacement sur la carte

source: Select Location
ar: اختيار الموقع
fr: Sélectionner l'emplacement

source: Location Coordinates
ar: إحداثيات الموقع
fr: Coordonnées de l'emplacement

source: Enter Coordinates Manually
ar: أدخل الإحداثيات يدويًا
fr: Entrer les coordonnées manuellement

source: Latitude
ar: دوائر العرض

source: Longitude
ar: خطوط الطول

# latitudeRequired
source: Latitude is required
ar: دوائر العرض مطلوبة
fr: La latitude est requise

# longitudeRequired
source: Longitude is required
ar: خطوط الطول مطلوبة
fr: La longitude est requise

# invalidLatitude
source: Invalid latitude value
ar: قيمة دوائر العرض غير صحيحة
fr: Valeur de latitude invalide

# invalidLongitude
source: Invalid longitude value
ar: قيمة خطوط الطول غير صحيحة
fr: Valeur de longitude invalide

# latitudeRange
source: Latitude must be between -90 and 90
ar: يجب أن تكون دوائر العرض بين -90 و 90
fr: La latitude doit être entre -90 et 90

# longitudeRange
source: Longitude must be between -180 and 180
ar: يجب أن تكون خطوط الطول بين -180 و 180
fr: La longitude doit être entre -180 et 180

source: Menu
ar: القائمة

source: Categories
ar: الفئات
fr: Catégories

source: Menu Items
ar: عناصر القائمة
fr: Articles du menu

source: Add Category
ar: إضافة فئة
fr: Ajouter une catégorie

source: Edit Category
ar: تعديل فئة
fr: Modifier la catégorie

source: Delete Category
ar: حذف فئة
fr: Supprimer la catégorie

source: Add Menu Item
ar: إضافة عنصر
fr: Ajouter un article

source: Edit Menu Item
ar: تعديل عنصر
fr: Modifier l'article

source: Delete Menu Item
ar: حذف عنصر
fr: Supprimer l'article

source: Category Name
ar: اسم الفئة
fr: Nom de la catégorie

source: Category Description
ar: وصف الفئة
fr: Description de la catégorie

source: Item Name
ar: اسم العنصر
fr: Nom de l'article

source: Item Description
ar: وصف العنصر
fr: Description de l'article

# itemPrice
source: Price
ar: السعر
fr: Prix

source: Preparation Time
ar: وقت التحضير
fr: Temps de préparation

source: Ingredients
ar: المكونات
fr: Ingrédients

source: Allergens
ar: مسببات الحساسية
fr: Allergènes

# nutritionalInfo
source: Nutritional Information
ar: المعلومات الغذائية
fr: Informations nutritionnelles

source: Image
ar: الصورة

source: Select Image
ar: اختر صورة
fr: Sélectionner une image

source: Take Photo
ar: التقاط صورة
fr: Prendre une photo

source: Choose from Gallery
ar: اختر من المعرض
fr: Choisir dans la galerie

source: Search
ar: بحث
fr: Rechercher

source: Filter
ar: تصفية
fr: Filtrer

source: Bulk Actions
ar: إجراءات مجمعة
fr: Actions groupées

source: Delete Selected
ar: حذف المحدد
fr: Supprimer la sélection

source: Toggle Availability
ar: تبديل التوفر
fr: Basculer la disponibilité

source: Reorder
ar: إعادة الترتيب
fr: Réorganiser

source: Drag to reorder
ar: اسحب لإعادة الترتيب
fr: Glisser pour réorganiser

source: Active
ar: نشط
fr: Actif

source: Inactive
ar: غير نشط
fr: Inactif

source: Edit
ar: تعديل
fr: Modifier

source: Delete
ar: حذف
fr: Supprimer

source: Featured
ar: مميز
fr: En vedette

source: Available
ar: متاح
fr: Disponible

source: Unavailable
ar: غير متاح
fr: Indisponible

source: Selected
ar: محدد
fr: Sélectionné

source: Make Unavailable
ar: جعل غير متاح
fr: Rendre indisponible

source: Make Available
ar: جعل متاح
fr: Rendre disponible

source: Remove
ar: إزالة
fr: Retirer

source: Remove Image
ar: إزالة الصورة
fr: Retirer l'image

source: Are you sure you want to remove this image?
ar: هل أنت متأكد أنك تريد إزالة هذه الصورة؟
fr: Êtes-vous sûr de vouloir retirer cette image ?

source: No Categories
ar: لا توجد فئات
fr: Aucune catégorie

# noCategoriesDescription
source: You haven't created any categories yet. Tap the + button to add one.
ar: لم تقم بإنشاء أي فئات بعد. اضغط على زر + لإضافة واحدة.
fr: Vous n'avez pas encore créé de catégories. Appuyez sur le bouton + pour en ajouter une.

source: No Menu Items
ar: لا توجد عناصر في القائمة
fr: Aucun article du menu

# noMenuItemsDescription
source: This category doesn't have any items yet. Tap the + button to add one.
ar: لا تحتوي هذه الفئة على أي عناصر بعد. اضغط على زر + لإضافة واحدة.
fr: Cette catégorie n'a pas encore d'articles. Appuyez sur le bouton + pour en ajouter un.

# areYouSureDeleteCategory
source: Are you sure you want to delete this category?
ar: هل أنت متأكد أنك تريد حذف هذه الفئة؟
fr: Êtes-vous sûr de vouloir supprimer cette catégorie ?

# areYouSureDeleteMenuItem
source: Are you sure you want to delete this menu item?
ar: هل أنت متأكد أنك تريد حذف عنصر القائمة هذا؟
fr: Êtes-vous sûr de vouloir supprimer cet article du menu ?

# areYouSureDeleteSelected
source: Are you sure you want to delete {count} selected item(s)?
ar: هل أنت متأكد أنك تريد حذف {count} عنصر(عناصر) محدد(ة)؟
fr: Êtes-vous sûr de vouloir supprimer {count} article(s) sélectionné(s) ?

# categoryHasItems
source: This category contains {count} item(s). Please delete or move the items first.
ar: تحتوي هذه الفئة على {count} عنصر(عناصر). يرجى حذف العناصر أو نقلها أولاً.
fr: Cette catégorie contient {count} article(s). Veuillez d'abord supprimer ou déplacer les articles.

# categoryNameRequired
source: Category name is required
ar: اسم الفئة مطلوب
fr: Le nom de la catégorie est requis

# itemNameRequired
source: Item name is required
ar: اسم العنصر مطلوب
fr: Le nom de l'article est requis

# priceRequired
source: Price is required
ar: السعر مطلوب
fr: Le prix est requis

# priceInvalid
source: Price must be greater than 0
ar: يجب أن يكون السعر أكبر من 0
fr: Le prix doit être supérieur à 0

# preparationTimeRequired
source: Preparation time is required
ar: وقت التحضير مطلوب
fr: Le temps de préparation est requis

# preparationTimeInvalid
source: Preparation time must be at least 1 minute
ar: يجب أن يكون وقت التحضير دقيقة واحدة على الأقل
fr: Le temps de préparation doit être d'au moins 1 minute

# categoryRequired
source: Category is required
ar: الفئة مطلوبة
fr: La catégorie est requise

source: Add Ingredient
ar: إضافة مكون
fr: Ajouter un ingrédient

source: Add Allergen
ar: إضافة مسبب حساسية
fr: Ajouter un allergène

source: Sort Order
ar: ترتيب الفرز
fr: Ordre de tri

source: Is Active
ar: نشط
fr: Est actif

source: Is Available
ar: متاح
fr: Est disponible

source: Is Featured
ar: مميز
fr: Est en vedette

source: Clear Filters
ar: مسح المرشحات
fr: Effacer les filtres

source: Sort by Name
ar: الفرز حسب الاسم
fr: Trier par nom

source: Sort by Price
ar: الفرز حسب السعر
fr: Trier par prix

source: Sort by Order
ar: الفرز حسب الترتيب
fr: Trier par ordre

# sortAscending
source: Ascending
ar: تصاعدي
fr: Croissant

# sortDescending
source: Descending
ar: تنازلي
fr: Décroissant

source: Min Price
ar: الحد الأدنى للسعر
fr: Prix minimum

source: Max Price
ar: الحد الأقصى للسعر
fr: Prix maximum

source: Select Category
ar: اختر الفئة
fr: Sélectionner une catégorie

source: Category created successfully
ar: تم إنشاء الفئة بنجاح
fr: Catégorie créée avec succès

source: Category updated successfully
ar: تم تحديث الفئة بنجاح
fr: Catégorie mise à jour avec succès

source: Category deleted successfully
ar: تم حذف الفئة بنجاح
fr: Catégorie supprimée avec succès

source: Menu item created successfully
ar: تم إنشاء عنصر القائمة بنجاح
fr: Article du menu créé avec succès

source: Menu item updated successfully
ar: تم تحديث عنصر القائمة بنجاح
fr: Article du menu mis à jour avec succès
