Repository: Majeedoso/delivery_manager
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

source: Discount Applies To
ar: الخصم ينطبق على

source: Order Subtotal
ar: المجموع الفرعي للطلب

source: Validity Period
ar: فترة الصلاحية

source: Start Date
ar: تاريخ البدء

source: End Date
ar: تاريخ الانتهاء

source: Restaurant (Optional)
ar: المطعم (اختياري)

source: Coupon Zones (Optional)
ar: مناطق القسيمة (اختياري)

source: Manage Zones
ar: إدارة المناطق

source: Usage Limits (Optional)
ar: حدود الاستخدام (اختياري)

source: Total uses
ar: إجمالي الاستخدامات

source: Per customer
ar: لكل عميل

source: Order Constraints (Optional)
ar: قيود الطلب (اختياري)

source: Min order (DZD)
ar: الحد الأدنى للطلب (دج)

source: Max discount (DZD)
ar: الحد الأقصى للخصم (دج)

source: Description (Optional)
ar: الوصف (اختياري)

# internalNoteHint
source: Internal note about this coupon...
ar: ملاحظة داخلية حول هذه القسيمة...

# noCouponZonesAvailable
source: No coupon zones available. Create zones to restrict coupon availability.
ar: لا توجد مناطق متاحة للقسيمة. أنشئ مناطق لتقييد توفر القسيمة.

# selectZonesInfo
source: Select zones (applies to all if none selected)
ar: اختر المناطق (ينطبق على الكل إذا لم يتم الاختيار)

source: zone
ar: منطقة

source: zones
ar: مناطق

# noRestaurantsAvailable
source: No restaurants available. This coupon will be global.
ar: لا توجد مطاعم متاحة. ستكون هذه القسيمة عامة.

source: Selected Restaurant
ar: المطعم المحدد

source: All Restaurants (Global)
ar: جميع المطاعم (عام)

source: km radius
ar: كم نصف قطر

source: Coupon Zones
ar: مناطق القسيمة

source: Add Zone
ar: إضافة منطقة

source: Success!
ar: نجح!

source: Error occurred
ar: حدث خطأ

source: No coupon zones yet
ar: لا توجد مناطق قسيمة بعد

# createZonesToRestrict
source: Create zones to restrict coupons\nto specific areas
ar: أنشئ مناطق لتقييد القسائم\nإلى مناطق محددة

source: Create Zone
ar: إنشاء منطقة

source: Edit Zone
ar: تعديل المنطقة

# zoneNameRequired
source: Zone Name *
ar: اسم المنطقة *

# zoneNameHint
source: e.g., Downtown Area
ar: مثال: منطقة وسط المدينة

source: Optional description
ar: وصف اختياري

# latitudeHint
source: e.g., 36.7538
ar: مثال: 36.7538

# longitudeHint
source: e.g., 3.0588
ar: مثال: 3.0588

source: Radius (km)
ar: نصف القطر (كم)

# radiusHint
source: e.g., 5.0
ar: مثال: 5.0

source: km
ar: كم

source: Zone name is required
ar: اسم المنطقة مطلوب

source: Delete Zone
ar: حذف المنطقة

# deleteZoneConfirmation
source: Are you sure you want to delete "{zoneName}"?
ar: هل أنت متأكد أنك تريد حذف "{zoneName}"؟

source: Delivery Preferences
fr: Pr?f?rences de livraison

# deliveryPreferencesDescription
source: Choose which restaurants you want to deliver for
fr: Choisissez les restaurants pour lesquels vous souhaitez livrer

source: Select All Restaurants
fr: Tout s?lectionner

# noSelectionAllRestaurantsHint
source: No selection means you will receive orders from all restaurants.
fr: Aucune s?lection signifie que vous recevrez les commandes de tous les restaurants.

source: Linked Restaurants
fr: Restaurants li?s

source: Add Restaurant by Code
fr: Ajouter un restaurant par code

source: Restaurant Code
fr: Code du restaurant

source: Enter restaurant code
fr: Saisissez le code du restaurant

# linkRestaurant
source: Link
fr: Lier

# linkRestaurantSuccess
source: Linked successfully
fr: Li? avec succ?s

# unlinkRestaurant
source: Unlinked successfully
fr: D?li? avec succ?s

# noLinkedRestaurants
source: No linked restaurants yet
fr: Aucun restaurant li? pour l'instant

# noLinkedRestaurantsDescription
source: Add a restaurant code to start delivering for specific restaurants.
fr: Ajoutez un code restaurant pour commencer ? livrer pour des restaurants sp?cifiques.
