Repository: Majeedoso/delivery_manager
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

# appName
source: Delivery Driver
ar: سائق التوصيل
fr: Chauffeur de Livraison

source: Login
ar: تسجيل الدخول
fr: Connexion

source: Sign Up
ar: إنشاء حساب
fr: S'inscrire

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور
fr: Mot de passe

source: Confirm Password
ar: تأكيد كلمة المرور
fr: Confirmer le mot de passe

source: Name
ar: الاسم
fr: Nom

source: Phone
ar: الهاتف
fr: Téléphone

source: Remember Me
ar: تذكرني
fr: Se souvenir de moi

source: Forgot Password
ar: نسيت كلمة المرور
fr: Mot de passe oublié

# dontHaveAccount
source: Don't have an account?
ar: ليس لديك حساب؟
fr: Vous n'avez pas de compte ?

# alreadyHaveAccount
source: Already have an account?
ar: لديك حساب بالفعل؟
fr: Vous avez déjà un compte ?

source: Sign in with Google
ar: تسجيل الدخول باستخدام جوجل
fr: Se connecter avec Google

source: Sign up with Google
ar: إنشاء حساب باستخدام جوجل
fr: S'inscrire avec Google

source: Sign up with Email
ar: إنشاء حساب بالبريد الإلكتروني
fr: S'inscrire avec Email

source: Create Account
ar: إنشاء حساب
fr: Créer un compte

source: Checking authentication...
ar: جاري فحص المصادقة...
fr: Vérification de l'authentification...

source: Welcome
ar: مرحباً
fr: Bienvenue

source: Logout
ar: تسجيل الخروج
fr: Déconnexion

source: Clear Saved Credentials
ar: مسح بيانات الاعتماد المحفوظة
fr: Effacer les identifiants sauvegardés

source: Language
ar: اللغة
fr: Langue

source: Select Language
ar: اختر اللغة
fr: Sélectionner la langue

source: English
ar: الإنجليزية
fr: Anglais

source: Arabic
ar: العربية
fr: Arabe

source: French
ar: الفرنسية
fr: Français

source: OR
ar: أو
fr: OU

source: Profile
ar: الملف الشخصي
fr: Profil

source: Profile Information
ar: معلومات الملف الشخصي
fr: Informations du profil

source: User Type
ar: نوع المستخدم
fr: Type d'utilisateur

source: Settings
ar: الإعدادات
fr: Paramètres

source: App Settings
ar: إعدادات التطبيق
fr: Paramètres de l'application

# selectedRestaurantsCount
source: {count} of {total} selected
ar: {count} ?? {total} ?????
fr: {count} sur {total} s?lectionn?s

# updatingSelections
source: Updating selections {done}/{total}...
ar: ???? ????? ??????? {done}/{total}...
fr: Mise ? jour des s?lections {done}/{total}...

source: Notifications
ar: الإشعارات

source: Push Notifications
ar: الإشعارات الفورية
fr: Notifications push

# pushNotificationsDescription
source: Receive push notifications
ar: تلقي الإشعارات الفورية
fr: Recevoir des notifications push

source: Email Notifications
ar: إشعارات البريد الإلكتروني
fr: Notifications par e-mail

# emailNotificationsDescription
source: Receive email notifications
ar: تلقي إشعارات البريد الإلكتروني
fr: Recevoir des notifications par e-mail

source: Privacy
ar: الخصوصية
fr: Confidentialité

source: Privacy Policy
ar: سياسة الخصوصية
fr: Politique de confidentialité

source: Terms of Service
ar: شروط الخدمة
fr: Conditions d'utilisation

source: App Information
ar: معلومات حول التطبيق
fr: Informations sur l'application

source: Version
ar: الإصدار

source: Check for Updates
ar: التحقق من التحديثات
fr: Vérifier les mises à jour

source: About App
ar: حول التطبيق
fr: À propos de l'application

# aboutDescription
source: This application is designed for delivery drivers to manage their deliveries efficiently. Drivers can view available orders, accept delivery requests, navigate to pickup and delivery locations, update delivery status in real-time, set their availability schedule, and track their earnings.
ar: هذا التطبيق مصمم لسائقي التوصيل لإدارة عمليات التوصيل بكفاءة. يمكن للسائقين عرض الطلبات المتاحة وقبول طلبات التوصيل والتنقل إلى مواقع الاستلام والتسليم وتحديث حالة التوصيل في الوقت الفعلي وتحديد جدول التوفر الخاص بهم وتتبع أرباحهم.
fr: Cette application est conçue pour les chauffeurs de livraison afin de gérer efficacement leurs livraisons. Les chauffeurs peuvent voir les commandes disponibles, accepter les demandes de livraison, naviguer vers les lieux de collecte et de livraison, mettre à jour le statut de livraison en temps réel, définir leur horaire de disponibilité et suivre leurs gains.

source: Features
ar: الميزات
fr: Fonctionnalités

source: User Authentication
ar: مصادقة المستخدم
fr: Authentification utilisateur

# userAuthenticationDescription
source: Secure login and registration system
ar: نظام تسجيل دخول وإنشاء حساب آمن
fr: Système de connexion et d'inscription sécurisé

source: Multi-Language Support
ar: دعم متعدد اللغات
fr: Support multilingue

# multiLanguageSupportDescription
source: Support for multiple languages
ar: دعم للغات متعددة
fr: Support pour plusieurs langues

source: Secure Storage
ar: التخزين الآمن
fr: Stockage sécurisé

# secureStorageDescription
source: Secure storage for sensitive data
ar: تخزين آمن للبيانات الحساسة
fr: Stockage sécurisé pour les données sensibles

source: Google Sign-In
ar: تسجيل الدخول بجوجل
fr: Connexion Google

# googleSignInDescription
source: Quick sign-in with Google account
ar: تسجيل دخول سريع بحساب جوجل
fr: Connexion rapide avec un compte Google

source: Contact Us
ar: اتصل بنا
fr: Nous contacter

# copyright
source: Â© 2024 Delivery Driver. All rights reserved.
ar: © 2024 سائق التوصيل. جميع الحقوق محفوظة.
fr: © 2024 Chauffeur de Livraison. Tous droits réservés.

source: Website
ar: الموقع الإلكتروني
fr: Site web

source: Edit Profile
ar: تعديل الملف الشخصي
fr: Modifier le profil

source: Change Password
ar: تغيير كلمة المرور
fr: Changer le mot de passe

source: Change Email
ar: تغيير البريد الإلكتروني
fr: Changer l'email

source: Update Profile
ar: تحديث الملف الشخصي
fr: Mettre à jour le profil

source: Main
ar: الرئيسية
fr: Principal

source: Pending Orders
ar: الطلبات المعلقة
fr: Commandes en attente

# pendingOrdersDescription
source: Manage orders waiting for verification
ar: إدارة الطلبات في انتظار التحقق
fr: Gérer les commandes en attente de vérification

source: Accept Order
ar: قبول الطلب
fr: Accepter la commande

source: Order accepted successfully!
ar: تم قبول الطلب بنجاح!
fr: Commande acceptée avec succès!

source: No orders available
ar: لا توجد طلبات متاحة
fr: Aucune commande disponible

# checkBackLater
source: Check back later for new orders
ar: عد لاحقاً للطلبات الجديدة
fr: Revenez plus tard pour de nouvelles commandes

source: Refresh
ar: تحديث
fr: Actualiser

source: No delivery address
ar: لا يوجد عنوان توصيل
fr: Aucune adresse de livraison

source: items
ar: عناصر
fr: articles

source: Total
ar: الإجمالي

source: Delivery Fee
ar: رسوم التوصيل
fr: Frais de livraison

source: Cash
ar: نقداً
fr: Espèces

source: Card
ar: بطاقة
fr: Carte

source: Confirmed
ar: مؤكد
fr: Confirmé

source: Ready for Pickup
ar: جاهز للاستلام
fr: Prête à récupérer

source: Show more
ar: عرض المزيد
fr: Voir plus

source: Show less
ar: عرض أقل
fr: Voir moins

# paymentMethod
source: Payment
ar: الدفع
fr: Paiement

# deliveryNotes
source: Notes
ar: ملاحظات

source: Ongoing Orders
ar: الطلبات الجارية
fr: Commandes en cours

# ongoingOrdersDescription
source: Manage your active deliveries
ar: إدارة التوصيلات النشطة
fr: Gérez vos livraisons actives

source: Archive Orders
ar: أرشيف الطلبات
fr: Archive des commandes

# archiveOrdersDescription
source: View accepted and rejected orders
ar: عرض الطلبات المقبولة والمرفوضة
fr: Voir les commandes acceptées et rejetées

source: Statistics
ar: الإحصائيات
fr: Statistiques

# statisticsDescription
source: View your performance metrics
ar: عرض مقاييس الأداء الخاصة بك
fr: Voir vos métriques de performance

# statisticsMoney
source: Money
ar: المال

# statisticsOrders
source: Orders
ar: الطلبات

# ordersPlaced
source: Placed
ar: تم الطلب

# ordersPendingVerification
source: Pending Verification
ar: قيد التحقق

# ordersAcceptedByOperator
source: Accepted by Operator
ar: تم القبول من قبل المشغل

# ordersAcceptedByRestaurant
source: Accepted by Restaurant
ar: تم القبول من قبل المطعم

# ordersRejectedByOperator
source: Rejected by Operator
ar: تم الرفض من قبل المشغل

# ordersRejectedByRestaurant
source: Rejected by Restaurant
ar: تم الرفض من قبل المطعم

# ordersAcceptedByDriver
source: Accepted by Driver
ar: تم القبول من قبل السائق

# ordersCancelled
source: Canceled
ar: ملغاة

source: No user data available
ar: لا توجد بيانات مستخدم متاحة
fr: Aucune donnée utilisateur disponible

source: User
ar: مستخدم
fr: Utilisateur

source: Orders
ar: الطلبات
fr: Commandes

source: Archive
ar: الأرشيف

source: Orders Archive
ar: أرشيف الطلبات
fr: Archive des commandes

source: Accepted Orders
ar: الطلبات المقبولة
fr: Commandes acceptées

source: Rejected Orders
ar: الطلبات المرفوضة
fr: Commandes rejetées

source: Delivered Orders
ar: الطلبات المسلمة
fr: Commandes livrées

source: Canceled Orders
ar: الطلبات الملغاة
fr: Commandes annulées

source: Cancelled
ar: ملغي
fr: Annulé

source: Reset Password
ar: إعادة تعيين كلمة المرور
fr: Réinitialiser le mot de passe

source: Reset Your Password
ar: إعادة تعيين كلمة المرور
fr: Réinitialiser votre mot de passe

# enterEmailDescription
source: Enter your email address and we'll send you an OTP code to reset your password.
ar: أدخل عنوان بريدك الإلكتروني وسنرسل لك رمز OTP لإعادة تعيين كلمة المرور.
fr: Entrez votre adresse email et nous vous enverrons un code OTP pour réinitialiser votre mot de passe.

source: Email Address
ar: عنوان البريد الإلكتروني
fr: Adresse email

source: Send Reset Link
ar: إرسال رابط إعادة التعيين
fr: Envoyer le lien de réinitialisation

source: Send OTP
ar: إرسال OTP
fr: Envoyer OTP

source: Back to Login
ar: العودة لتسجيل الدخول
fr: Retour à la connexion

source: Enter OTP Code
ar: أدخل رمز OTP
fr: Entrez le code OTP

# enterOtpDescription
source: Enter the 6-digit OTP sent to your email It will be verified automatically when complete
ar: أدخل رمز OTP المكون من 6 أرقام المرسل إلى بريدك الإلكتروني سيتم التحقق منه تلقائياً عند الاكتمال
fr: Entrez le code OTP à 6 chiffres envoyé à votre email Il sera vérifié automatiquement une fois terminé

source: Set New Password
ar: تعيين كلمة مرور جديدة
fr: Définir un nouveau mot de passe

# enterNewPasswordDescription
source: Enter your new password below
ar: أدخل كلمة المرور الجديدة أدناه
fr: Entrez votre nouveau mot de passe ci-dessous

source: New Password
ar: كلمة المرور الجديدة
fr: Nouveau mot de passe

# confirmNewPassword
source: Confirm Password
ar: تأكيد كلمة المرور
fr: Confirmer le mot de passe

source: Resend OTP
ar: إعادة إرسال OTP
fr: Renvoyer OTP

source: Verify Email
ar: التحقق من البريد الإلكتروني
fr: Vérifier l'email

source: Enter OTP
ar: أدخل رمز OTP
fr: Entrez le code OTP

source: OTP sent to
ar: تم إرسال رمز OTP إلى
fr: Code OTP envoyé à

source: Verify OTP
ar: التحقق من OTP
fr: Vérifier le code OTP

source: Confirm Email Change
ar: تأكيد تغيير البريد الإلكتروني
fr: Confirmer le changement d'email

# resendIn
source: You can resend OTP in {seconds}s
ar: يمكنك إعادة إرسال OTP خلال {seconds} ثانية
fr: Vous pouvez renvoyer OTP dans {seconds}s

source: Email Not Verified
ar: البريد الإلكتروني غير موثق
fr: Email non vérifié

# emailVerificationRequired
source: Please verify your email address before accessing this resource. A verification code (OTP) has been sent to your email address. Please check your inbox and enter the 6-digit code to verify your email.
ar: يرجى التحقق من عنوان بريدك الإلكتروني قبل الوصول إلى هذا المورد. تم إرسال رمز التحقق (OTP) إلى عنوان بريدك الإلكتروني. يرجى التحقق من صندوق الوارد وإدخال الرمز المكون من 6 أرقام للتحقق من بريدك الإلكتروني.
fr: Veuillez vérifier votre adresse e-mail avant d'accéder à cette ressource. Un code de vérification (OTP) a été envoyé à votre adresse e-mail. Veuillez vérifier votre boîte de réception et entrer le code à 6 chiffres pour vérifier votre e-mail.

# resendVerificationEmail
source: Resend Verification
ar: إعادة التحقق
fr: Renvoyer la vérification

# verificationEmailSent
source: Verification email sent successfully. Please check your inbox.
ar: تم إرسال بريد التحقق بنجاح. يرجى التحقق من صندوق الوارد.
fr: E-mail de vérification envoyé avec succès. Veuillez vérifier votre boîte de réception.

source: Checking...
ar: جاري الفحص...
fr: Vérification...

source: Check Status
ar: فحص الحالة
fr: Vérifier le statut

# checkStatusDescription
source: Tap "Check Status" to see if your account has been approved
ar: اضغط على "فحص الحالة" لمعرفة ما إذا تمت الموافقة على حسابك
fr: Appuyez sur "Vérifier le statut" pour voir si votre compte a été approuvé

# notificationsRequired
source: Notifications are required for this app
ar: الإشعارات مطلوبة لهذا التطبيق
fr: Les notifications sont requises pour cette application

# notificationsRequiredDescription
source: This app requires notification permission to receive new order alerts.
ar: يتطلب هذا التطبيق إذن الإشعارات لتلقي تنبيهات الطلبات الجديدة.
fr: Cette application nécessite l'autorisation de notification pour recevoir des alertes de nouvelles commandes.

source: Enable Notifications
ar: تفعيل الإشعارات
fr: Activer les notifications

source: Exit App
ar: إغلاق التطبيق
fr: Quitter l'application

source: Initializing...
ar: جاري التهيئة...
fr: Initialisation...

source: Checking notifications...
ar: جاري فحص الإشعارات...
fr: Vérification des notifications...

source: Setting up notifications...
ar: جاري إعداد الإشعارات...
fr: Configuration des notifications...

source: Initialization failed
ar: فشل في التهيئة
fr: Échec de l'initialisation

source: Requesting permission...
ar: جاري طلب الإذن...
fr: Demande d'autorisation...

source: Permission request failed
ar: فشل في طلب الإذن
fr: Échec de la demande d'autorisation

# checkingInternet
source: Checking internet connection...
ar: جاري فحص الاتصال بالإنترنت...
fr: Vérification de la connexion Internet...

source: No internet connection
ar: لا يوجد اتصال بالإنترنت
fr: Pas de connexion Internet

# noInternetDescription
source: Please check your internet connection and try again.
ar: يرجى التحقق من اتصالك بالإنترنت والمحاولة مرة أخرى.
fr: Veuillez vérifier votre connexion Internet et réessayer.

source: Retry
ar: إعادة المحاولة
fr: Réessayer

source: Update Required
ar: تحديث مطلوب
fr: Mise à jour requise

# updateRequiredDescription
source: A new version of the app is available. Please update to continue using the app.
ar: إصدار جديد من التطبيق متاح. يرجى التحديث للمتابعة في استخدام التطبيق.
fr: Une nouvelle version de l'application est disponible. Veuillez mettre à jour pour continuer à utiliser l'application.

source: Minimum Required Version
ar: الحد الأدنى المطلوب للإصدار
fr: Version minimale requise

source: Latest Available Version
ar: أحدث إصدار متاح
fr: Dernière version disponible

source: Update Now
ar: تحديث الآن
fr: Mettre à jour maintenant

# updateIsRequired
source: Update is required to continue
ar: التحديث مطلوب للمتابعة
fr: La mise à jour est requise pour continuer

source: Your Current Version
ar: إصدارك الحالي
fr: Votre version actuelle

# updateAvailable
source: An update is available. Please update to continue using the app.
ar: تحديث متاح. يرجى التحديث للمتابعة في استخدام التطبيق.
fr: Une mise à jour est disponible. Veuillez mettre à jour pour continuer à utiliser l'application.

# updateAvailableOptional
source: A new version is available. Update to get the latest features.
ar: إصدار جديد متاح. قم بالتحديث للحصول على أحدث الميزات.
fr: Une nouvelle version est disponible. Mettez à jour pour obtenir les dernières fonctionnalités.

# appUpToDate
source: Your app is up to date!
ar: التطبيق محدث!
fr: Votre application est à jour!

source: Account Status
ar: حالة الحساب
fr: Statut du compte

# areYouSureLogout
source: Are you sure you want to logout?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟
fr: Êtes-vous sûr de vouloir vous déconnecter ?

source: Cancel
ar: إلغاء
fr: Annuler

source: Theme
ar: المظهر
fr: Thème

source: Light
ar: فاتح
fr: Clair

source: Dark
ar: داكن
fr: Sombre

source: System
ar: النظام
fr: Système

# pleaseEnterEmail
source: Please enter your email
ar: الرجاء إدخال بريدك الإلكتروني
fr: Veuillez entrer votre e-mail

# pleaseEnterValidEmail
source: Please enter a valid email
ar: الرجاء إدخال بريد إلكتروني صالح
fr: Veuillez entrer un e-mail valide

# pleaseEnterPassword
source: Please enter your password
ar: الرجاء إدخال كلمة المرور
fr: Veuillez entrer votre mot de passe

# passwordMinLength
source: Password must be at least 6 characters
ar: يجب أن تكون كلمة المرور 6 أحرف على الأقل
fr: Le mot de passe doit contenir au moins 6 caractères

source: New Email Address
ar: عنوان البريد الإلكتروني الجديد
fr: Nouvelle adresse e-mail

source: Current Password
ar: كلمة المرور الحالية
fr: Mot de passe actuel

# newEmailMustBeDifferent
source: New email must be different from current email
ar: يجب أن يكون البريد الإلكتروني الجديد مختلفًا عن البريد الإلكتروني الحالي
fr: La nouvelle adresse e-mail doit être différente de l'adresse e-mail actuelle

source: day
ar: يوم
fr: jour

source: Week
ar: أسبوع
fr: Semaine

source: Month
ar: شهر
fr: Mois

source: Year
ar: سنة
fr: Année

source: Date Range
ar: نطاق تاريخ
fr: Plage de dates

source: Select Period
ar: اختر الفترة
fr: Sélectionner la période

source: From
ar: من
fr: De

source: To
ar: إلى
fr: À

source: Select date
ar: اختر التاريخ
fr: Sélectionner la date

source: Error loading statistics
ar: خطأ في تحميل الإحصائيات
fr: Erreur lors du chargement des statistiques

source: No statistics available
ar: لا تتوفر إحصائيات
fr: Aucune statistique disponible

source: Overview
ar: نظرة عامة
fr: Aperçu

source: Total Orders
ar: إجمالي الطلبات
fr: Total des commandes

source: Accepted
ar: مقبول
fr: Accepté

source: Pending
ar: قيد الانتظار
fr: En attente

source: Rejected
ar: مرفوض
fr: Rejeté

source: Performance Metrics
ar: مقاييس الأداء
fr: Métriques de performance

source: Average Responding Time
ar: متوسط وقت الاستجابة
fr: Temps de réponse moyen

# acceptedOrdersSuccessRate
source: Good Decisions Rate
ar: معدل القرارات الجيدة
fr: Taux de bonnes décisions

# acceptedOrdersSuccessRateExplanation
source: Measures how many accepted orders were successfully delivered. This is a positive metric that focuses on successes.
ar: يقيس عدد الطلبات المقبولة التي تم تسليمها بنجاح. هذا مقياس إيجابي يركز على النجاحات.
fr: Mesure le nombre de commandes acceptées qui ont été livrées avec succès. Il s'agit d'une métrique positive qui se concentre sur les succès.

# acceptedOrdersSuccessRateGood
source: High success rate means you're accepting orders you can fulfill reliably.
ar: معدل نجاح عالي يعني أنك تقبل طلبات يمكنك تنفيذها بشكل موثوق.
fr: Un taux de succès élevé signifie que vous acceptez des commandes que vous pouvez honorer de manière fiable.

# acceptedOrdersSuccessRateBad
source: Low success rate indicates issues with order fulfillment - review your capacity.
ar: معدل نجاح منخفض يشير إلى مشاكل في تنفيذ الطلبات - راجع قدرتك.
fr: Un taux de succès faible indique des problèmes - vérifiez votre capacité.

# acceptedOrdersFailureRate
source: Bad Decisions Rate
ar: معدل القرارات السيئة
fr: Taux de mauvaises décisions

# acceptedOrdersFailureRateExplanation
source: Measures how many accepted orders failed for any reason (canceled, returned, refused by customer, not delivered). This is a negative metric that focuses on failures.
ar: يقيس عدد الطلبات المقبولة التي فشلت لأي سبب (ملغاة، مسترجعة، رفضها العميل، لم يتم تسليمها). هذا مقياس سلبي يركز على الفشل.
fr: Mesure le nombre de commandes acceptées qui ont échoué pour une raison quelconque (annulées, retournées, refusées par le client, non livrées). Il s'agit d'une métrique négative qui se concentre sur les échecs.

# acceptedOrdersFailureRateGood
source: Low failure rate shows reliable order handling.
ar: معدل فشل منخفض يظهر معالجة موثوقة للطلبات.
fr: Un faible taux d'échec montre une gestion fiable des commandes.

# acceptedOrdersFailureRateBad
source: High failure rate damages reputation - consider why orders are failing.
ar: معدل فشل عالي يضر بالسمعة - فكر لماذا تفشل الطلبات.
fr: Un taux d'échec élevé nuit à la réputation - analysez pourquoi les commandes échouent.

# averageRespondingTimeExplanation
source: Measures the average time it takes for the operator to respond to an order (accept or reject) after it's created.
ar: يقيس متوسط الوقت الذي يستغرقه المشغل للرد على الطلب (قبول أو رفض) بعد إنشائه.
fr: Mesure le temps moyen qu'il faut à l'opérateur pour répondre à une commande (accepter ou rejeter) après sa création.

# averageRespondingTimeGood
source: Fast response times lead to better customer satisfaction and higher order acceptance.
ar: أوقات الاستجابة السريعة تؤدي إلى رضا العملاء وقبول أعلى للطلبات.
fr: Des temps de réponse rapides mènent à une meilleure satisfaction client et plus de commandes acceptées.

# averageRespondingTimeBad
source: Slow response times may result in cancelled orders and unhappy customers.
ar: أوقات الاستجابة البطيئة قد تؤدي إلى إلغاء الطلبات وعدم رضا العملاء.
fr: Des temps de réponse lents peuvent entraîner des annulations et des clients mécontents.

source: When good
ar: عندما يكون جيداً
fr: Quand c'est bien

source: When bad
ar: عندما يكون سيئاً
fr: Quand c'est mauvais

source: Close
ar: إغلاق
fr: Fermeture

source: Order Breakdown
ar: تفصيل الطلبات
fr: Répartition des commandes

source: All
ar: الكل
fr: Tout

source: second
ar: ثانية
fr: seconde

source: seconds
ar: ثواني
fr: secondes

source: minute
ar: دقيقة

source: minutes
ar: دقائق

source: hour
ar: ساعة
fr: heure

source: hours
ar: ساعات
fr: heures

source: days
ar: أيام
fr: jours

# errorGeneric
source: Something went wrong. Please try again.
ar: حدث خطأ ما. يرجى المحاولة مرة أخرى.
fr: Une erreur s'est produite. Veuillez réessayer.

# errorNetworkTimeout
source: Request timed out. Please check your internet connection and try again.
ar: انتهت مهلة الطلب. يرجى التحقق من اتصالك بالإنترنت والمحاولة مرة أخرى.
fr: La demande a expiré. Veuillez vérifier votre connexion Internet et réessayer.

# errorConnectionError
source: Cannot connect to server. Please check your internet connection and ensure the server is running.
ar: لا يمكن الاتصال بالخادم. يرجى التحقق من اتصالك بالإنترنت والتأكد من أن الخادم يعمل.
fr: Impossible de se connecter au serveur. Veuillez vérifier votre connexion Internet et vous assurer que le serveur fonctionne.

# errorRequestCancelled
source: Request was cancelled. Please try again.
ar: تم إلغاء الطلب. يرجى المحاولة مرة أخرى.
fr: La demande a été annulée. Veuillez réessayer.

# errorNetworkGeneric
source: Network error occurred. Please check your internet connection and try again.
ar: حدث خطأ في الشبكة. يرجى التحقق من اتصالك بالإنترنت والمحاولة مرة أخرى.
fr: Une erreur réseau s'est produite. Veuillez vérifier votre connexion Internet et réessayer.

# errorInvalidRequest
source: Invalid request. Please check your input and try again.
ar: طلب غير صالح. يرجى التحقق من المدخلات والمحاولة مرة أخرى.
fr: Demande invalide. Veuillez vérifier vos entrées et réessayer.

# errorSessionExpired
source: Your session has expired. Please login again.
ar: انتهت صلاحية جلستك. يرجى تسجيل الدخول مرة أخرى.
fr: Votre session a expiré. Veuillez vous reconnecter.

# errorNoPermission
source: You do not have permission to perform this action.
ar: ليس لديك إذن لتنفيذ هذا الإجراء.
fr: Vous n'avez pas la permission d'effectuer cette action.

# errorNotFound
source: The requested resource was not found.
ar: لم يتم العثور على المورد المطلوب.
fr: La ressource demandée est introuvable.

# errorConflict
source: This action conflicts with the current state. Please refresh and try again.
ar: يتعارض هذا الإجراء مع الحالة الحالية. يرجى التحديث والمحاولة مرة أخرى.
fr: Cette action entre en conflit avec l'état actuel. Veuillez actualiser et réessayer.

# errorValidation
source: Validation error. Please check your input.
ar: خطأ في التحقق. يرجى التحقق من المدخلات.
fr: Erreur de validation. Veuillez vérifier vos entrées.

# errorTooManyRequests
source: Too many requests. Please wait a moment and try again.
ar: طلبات كثيرة جداً. يرجى الانتظار قليلاً والمحاولة مرة أخرى.
fr: Trop de demandes. Veuillez attendre un moment et réessayer.
